# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd

Next, extract and import `Orders` dataset into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [2]:
# your code here
orders = pd.read_csv('Orders.zip')
orders

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [23]:
# your code here

#subproblem 1
subprob_one = orders.groupby(["CustomerID"])["amount_spent"].agg(['sum'])
subprob_one

                 sum
CustomerID
12346       77183.60
12347        4310.00
12348        1797.24
12349        1757.55
12350         334.40
...              ...
18280         180.60
18281          80.82
18282         178.05
18283        2094.88
18287        1837.28

[4339 rows x 1 columns]

In [65]:
#subproblem 2

spent_scale = ['Very Low', 'Low', 'Moderate', 'High', 'Very High']

'''VIPs are Very High spenders, favourited just "high".'''

subprob_one["scale of spent"] = pd.qcut(subprob_one['sum'], 5, labels = spent_scale)
subprob_one.sort_values("sum", ascending=False)

                  sum scale of spent
CustomerID
14646       280206.02      Very High
18102       259657.30      Very High
17450       194550.79      Very High
16446       168472.50      Very High
14911       143825.06      Very High
...               ...            ...
17956           12.75       Very Low
16454            6.90       Very Low
14792            6.20       Very Low
16738            3.75       Very Low
13256            0.00       Very Low

[4339 rows x 2 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [92]:
# your code here

vip_country = orders.groupby(["CustomerID", "Country"])["amount_spent"].agg(['sum'])
vip_country["scale of spent"] = pd.qcut(vip_country['sum'], 5, labels = spent_scale)
vip_country.sort_values(by=['sum'], ascending =False, inplace =True)

vip_country.reset_index(inplace=True)

very_highs = vip_country[vip_country["scale of spent"] == "Very High"]
very_highs["Country"].value_counts()

United Kingdom     740
Germany             34
France              27
Belgium              8
Spain                7
Switzerland          7
Portugal             6
Norway               6
Japan                4
Italy                4
Finland              3
Denmark              3
Australia            3
EIRE                 3
Sweden               2
Cyprus               2
Israel               2
Channel Islands      2
Poland               1
Austria              1
Greece               1
Iceland              1
Netherlands          1
Canada               1
Singapore            1
Name: Country, dtype: int64

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [98]:
# your code here

highs = vip_country[vip_country["scale of spent"] == "High"]

combined_cust = pd.concat([very_highs, highs])
combined_cust["Country"]

      CustomerID         Country        sum scale of spent
0          14646     Netherlands  280206.02      Very High
1          18102  United Kingdom  259657.30      Very High
2          17450  United Kingdom  194550.79      Very High
3          16446  United Kingdom  168472.50      Very High
4          14911            EIRE  143825.06      Very High
...          ...             ...        ...            ...
1734       12820  United Kingdom     942.34           High
1735       14075  United Kingdom     942.26           High
1736       15576  United Kingdom     940.67           High
1737       15289  United Kingdom     939.78           High
1738       17527  United Kingdom     939.37           High

[1739 rows x 4 columns]